常见的MySQL函数。

### 字符串相关函数：
- char_length()  获取字符串长度，相当于len
- concat  字符串拼接
- concat_ws 字符串拼接with separator
- group_concat  组拼接，用于group by
- format 国际金融格式100,000,000.00
- insert 从指定位置插入指定的字符串，相当于replace
- locate  定位最早的匹配的字符串的所在位置
- lcase  小写化
- ucase  大写化
- left  取左
- right 取右
- trim，ltrim，rtrim 去除空格
- replace 替换
- reverse 反向
- substring 截取子字符串

### 数字函数
- ceil
- floor
- max
- min
- count
- avg
- abs
- sum
### 时间类函数
- now(), sysdate()
- current_date
- current_time
- date
- year
- month
- day
- time
- adddate(now(), interval 1 Hour)
- subdate(now(), interval 2 Day)
- date_format(now(), '%Y-%m-%d-%r')
- date_format(now(), '%Y-%m-%d %H:%i:%s')

### 条件语句
- if
- ifnull
- isnull
- case

## 一、字符串函数

### 1. char_length(str)
返回字符串长度。从结果来看，空格也算长度。如果字符串是null，则返回null。

mysql> select char_length('this is a string.') as length; 
+--------+
| length |
+--------+
|     17 |
+--------+
1 row in set (0.00 sec)

### 2. concat(str1, str2, ...)
连接字符串。
如果有任意字符串为null，那么返回结果为null。

mysql> select concat('1992','-','01','-','01') as c;
+------------+
| c          |
+------------+
| 1992-01-01 |
+------------+
1 row in set (0.00 sec)

mysql> select concat('str1',null) as n;
+------+
| n    |
+------+
| NULL |
+------+
1 row in set (0.00 sec)

### 3. concat_ws(separator,str1,str2,...)
全称就是concat_with_seperation，指定分隔字符串拼接字符串。

mysql> select concat_ws('-',1992,01,01) as d;
+----------+
| d        |
+----------+
| 1992-1-1 |
+----------+
1 row in set (0.00 sec)

如果有任意字符串为null，则忽略掉这个null。

mysql> select concat_ws('-',1992,01,null) as d;  
+--------+
| d      |
+--------+
| 1992-1 |
+--------+
1 row in set (0.00 sec)

### 4. group_concat (column_name)
可以用于group by查看一些不能合并的列的值。

mysql> SELECT student_name,
    ->     GROUP_CONCAT(test_score)
    ->     FROM student
    ->     GROUP BY student_name;

mysql> select student_id,group_concat(num) from score group by student_id;
+------------+-------------------+
| student_id | group_concat(num) |
+------------+-------------------+
|          1 | 10,9,66           |
|          2 | 8,65,68,99        |
|          3 | 77,66,87,99       |
|          4 | 79,11,67,100      |
|          5 | 79,11,67,100      |
|          6 | 9,100,67,100      |
|          7 | 9,100,67,88       |
|          8 | 9,100,67,88       |
|          9 | 91,88,67,22       |
|         10 | 90,77,43,87       |
|         11 | 90,77,43,87       |
|         12 | 90,77,43,87       |
|         13 | 65,87             |
|         14 | 65                |
|         15 | 65                |
|         16 | 65                |
+------------+-------------------+
16 rows in set (0.00 sec)

### 5. FORMAT(X,D[,locale])
国际化金额函数。
把数字或者数字字符串，转为国际化的格式，并且还能保留小数位。

mysql> select format('1245566.75325',2);
+---------------------------+
| format('1245566.75325',2) |
+---------------------------+
| 1,245,566.75              |
+---------------------------+
1 row in set (0.00 sec)

参数x为数值或字符串格式的数值，d为小数位（rounded四舍五入），

locale参数为

The optional third parameter enables a locale to be specified to be
used for the result number's decimal point, thousands separator, and
grouping between separators. Permissible locale values are the same as
the legal values for the lc_time_names system variable (see
http://dev.mysql.com/doc/refman/5.5/en/locale-support.html). If no
locale is specified, the default is 'en_US'.

Examples:
mysql> SELECT FORMAT(12332.123456, 4);
        -> '12,332.1235'
mysql> SELECT FORMAT(12332.1,4);
        -> '12,332.1000'
mysql> SELECT FORMAT(12332.2,0);
        -> '12,332'
mysql> SELECT FORMAT(12332.2,2,'de_DE');
        -> '12.332,20'

### 6. insert(str, start,end, sub_str)
字符串替换。把给定字符串从【start, end】替换为给定字符串。

mysql> select insert('XIAO da yu',1,5,'xxxx-') as name; 
+------------+
| name       |
+------------+
| xxxx-da yu |
+------------+
1 row in set (0.00 sec)

就是将XIAO da yu的第1位到第5位，替换成xxxx-。

### 7. LOCATE(substr,str), LOCATE(substr,str,pos)
字符串定位。某个字符串首次出现的位置。有null运算返回null。

Examples:
mysql> SELECT LOCATE('bar', 'foobarbar');
        -> 4
mysql> SELECT LOCATE('xbar', 'foobar');
        -> 0
mysql> SELECT LOCATE('bar', 'foobarbar', 5);
        -> 7

mysql> select locate('da','xiao da yu');
+---------------------------+
| locate('da','xiao da yu') |
+---------------------------+
|                         6 |
+---------------------------+
1 row in set (0.00 sec)

mysql> select insert ('从头开始学mysql',locate('mysql','从头开始学mysql'),char_length('mysql'),'MySQL') as blogName;
+----------------------+
| blogName             |
+----------------------+
| 从头开始学MySQL      |
+----------------------+
1 row in set (0.00 sec)

首先要定位到"mysql"的开始位置，然后计算出"mysql"的长度。最后用"MySQL"替换"mysql"。

### 8. LCASE(str)
将字符串小写化。

mysql> select lcase('MYSQL') as lower;
+-------+
| lower |
+-------+
| mysql |
+-------+
1 row in set (0.00 sec)

### 8. UCASE(str)
将字符串大写化。

mysql> select ucase('mysql') as upper; 
+-------+
| upper |
+-------+
| MYSQL |
+-------+
1 row in set (0.00 sec)

### 9. LEFT(str,len)

从左侧取字符串的指定长度。

mysql> select left('mysql',2) as f12;
+-----+
| f12 |
+-----+
| my  |
+-----+
1 row in set (0.00 sec)

### 10. right(str, len)

从字符串右侧取指定长度。

mysql> select right('mysql',3) as last;
+------+
| last |
+------+
| sql  |
+------+
1 row in set (0.00 sec)

### 11. TRIM, LTRIM, RTRIM 
去除首位空格。  
- TRIM去掉两边的空格；
- LTRM去掉左边的空格；
- RTRIM去掉右边空格。

mysql> SELECT TRIM('  bar   ');
        -> 'bar'
mysql> SELECT TRIM(LEADING 'x' FROM 'xxxbarxxx');
        -> 'barxxx'
mysql> SELECT TRIM(BOTH 'x' FROM 'xxxbarxxx');
        -> 'bar'
mysql> SELECT TRIM(TRAILING 'xyz' FROM 'barxxyz');
        -> 'barx'

### 12. replace(str, find_str, re_str)
替换

mysql> select replace('Mysql','sql','SQL') as result;
+--------+
| result |
+--------+
| MySQL  |
+--------+
1 row in set (0.00 sec)

### 13. REVERSE(str)
反转

mysql> select reverse('abcdefg');
+--------------------+
| reverse('abcdefg') |
+--------------------+
| gfedcba            |
+--------------------+
1 row in set (0.00 sec)

### 14. substring 
截取
- SUBSTRING(str,pos), 
- SUBSTRING(str FROM pos), 
- SUBSTRING(str,pos,len),
- SUBSTRING(str FROM pos FOR len)

mysql> SELECT SUBSTRING('Quadratically',5);
        -> 'ratically'
mysql> SELECT SUBSTRING('foobarbar' FROM 4);
        -> 'barbar'
mysql> SELECT SUBSTRING('Quadratically',5,6);
        -> 'ratica'
mysql> SELECT SUBSTRING('Sakila', -3);
        -> 'ila'
mysql> SELECT SUBSTRING('Sakila', -5, 3);
        -> 'aki'
mysql> SELECT SUBSTRING('Sakila' FROM -4 FOR 2);
        -> 'ki'

---

## 二、数字函数

为了方便操作，先创建t_grade表，并初始化一些数据。

mysql> drop table if exists t_grade;
Query OK, 0 rows affected, 1 warning (0.00 sec)

mysql> create table t_grade(
    -> id BIGINT primary key auto_increment,
    -> grade decimal(5,2) not null);
Query OK, 0 rows affected (0.01 sec)

mysql> insert into t_grade(grade) values(88.5),(-71.5),(-96),(58.5),(80);
Query OK, 5 rows affected (0.00 sec)
Records: 5  Duplicates: 0  Warnings: 0

mysql> select * from t_grade;
+----+--------+
| id | grade  |
+----+--------+
|  1 |  88.50 |
|  2 | -71.50 |
|  3 | -96.00 |
|  4 |  58.50 |
|  5 |  80.00 |
+----+--------+
5 rows in set (0.00 sec)

### 1. ceil, floor 
获取大于它的最小整数，获取小于它的最大整数

mysql> select grade, ceil(grade) as '大于它的最小整数',floor(grade) as '小于它的最大整数' from t_grade;
+--------+--------------------------+--------------------------+
| grade  | 大于它的最小整数         | 小于它的最大整数         |
+--------+--------------------------+--------------------------+
|  88.50 |                       89 |                       88 |
| -71.50 |                      -71 |                      -72 |
| -96.00 |                      -96 |                      -96 |
|  58.50 |                       59 |                       58 |
|  80.00 |                       80 |                       80 |
+--------+--------------------------+--------------------------+
5 rows in set (0.00 sec)

### 2. abs绝对值

mysql> select id,grade,abs(grade) as abs from t_grade;
+----+--------+-------+
| id | grade  | abs   |
+----+--------+-------+
|  1 |  88.50 | 88.50 |
|  2 | -71.50 | 71.50 |
|  3 | -96.00 | 96.00 |
|  4 |  58.50 | 58.50 |
|  5 |  80.00 | 80.00 |
+----+--------+-------+
5 rows in set (0.00 sec)

### 3. max，min，avg最大值，最小值，平均值

mysql> select max(grade),min(grade),avg(grade) from t_grade;
+------------+------------+------------+
| max(grade) | min(grade) | avg(grade) |
+------------+------------+------------+
|      88.50 |     -96.00 |  11.900000 |
+------------+------------+------------+
1 row in set (0.00 sec)

### 4. 个数count

mysql> select sum(grade),count(grade) from t_grade;
+------------+--------------+
| sum(grade) | count(grade) |
+------------+--------------+
|      59.50 |            5 |
+------------+--------------+
1 row in set (0.00 sec)

### 5. 总和sum

mysql> select sum(grade),count(grade) from t_grade;
+------------+--------------+
| sum(grade) | count(grade) |
+------------+--------------+
|      59.50 |            5 |
+------------+--------------+
1 row in set (0.00 sec)

---

## 三、时间函数

### 1. 当前时间 now(), current_time, current_date，SYSDATE()与NOW()一样

mysql> select now(),current_date,current_time;        
+---------------------+--------------+--------------+
| now()               | current_date | current_time |
+---------------------+--------------+--------------+
| 2019-09-03 01:24:22 | 2019-09-03   | 01:24:22     |

### 2. 提取日期时间表达式中的不同时间date,year,month,day,time

mysql> select now(),date(now()) as date,year(now()) as year,month(now()) as month, day(now()) as day, time(now()) as now;
+---------------------+------------+------+-------+------+----------+
| now()               | date       | year | month | day  | now      |
+---------------------+------------+------+-------+------+----------+
| 2019-09-03 01:29:00 | 2019-09-03 | 2019 |     9 |    3 | 01:29:00 |
+---------------------+------------+------+-------+------+----------+
1 row in set (0.00 sec)

### 3. 以当前时间为基准，增加时间和减少时间adddate，subdate
- adddate(now(), interval 1 Hour)
- subdate(now(), interval 2 Day)

mysql> SELECT  now(), 
    ADDDATE(now(), 
    INTERVAL 1 second) '1秒后',
    ADDDATE(now(), INTERVAL 1 minute) '1分后',
    ADDDATE(now(), INTERVAL 1 hour)   '1小时后', 
    ADDDATE(now(), INTERVAL 1 day)    '1天后',   
    SUBDATE(now(), INTERVAL 2 day)    '2天前';

| now()               | 1秒后               | 1分后               | 1小时后             | 1天后               | 2天前               |

| 2019-09-03 01:32:07 | 2019-09-03 01:32:08 | 2019-09-03 01:33:07 | 2019-09-03 02:32:07 | 2019-09-04 01:32:07 | 2019-09-01 01:32:07 |

练习：获取前三个小时到当前时间的所有记录。

# 数据准备 
mysql> drop table if exists t_time_test;
Query OK, 0 rows affected, 1 warning (0.00 sec)

mysql> create table t_time_test(
    -> time_sir varchar(20) not null);
Query OK, 0 rows affected (0.01 sec)

mysql> insert into t_time_test values('2019-08-29 10:00'),('2019-08-29 11:00'),('2019-08-29 12:00'),('2019-08-29 13:00'),('2019-08-29 14:00');
Query OK, 5 rows affected (0.00 sec)
Records: 5  Duplicates: 0  Warnings: 0

mysql> select * from t_time_test;
+------------------+
| time_sir         |
+------------------+
| 2019-08-29 10:00 |
| 2019-08-29 11:00 |
| 2019-08-29 12:00 |
| 2019-08-29 13:00 |
| 2019-08-29 14:00 |
+------------------+
5 rows in set (0.00 sec)

SELECT  t.* , now() AS '当前时间' FROM T_TIME_TEST t
WHERE t.TIME_STR BETWEEN SUBDATE(now(), INTERVAL 3 HOUR) AND now()

### 4. 时间格式化date_format



- date_format(now(), '%Y-%m-%d-%r')
- date_format(now(), '%Y-%m-%d %H:%i:%s')

mysql> SELECT  DATE_FORMAT(now(),'%Y-%m-%d-%r') AS '全', DATE_FORMAT(now(),'%Y-%m-%d %H:%i:%s') '年月日 时分秒';
+------------------------+---------------------+
| 全                     | 年月日 时分秒       |
+------------------------+---------------------+
| 2019-09-03-01:39:25 AM | 2019-09-03 01:39:25 |
+------------------------+---------------------+
1 row in set (0.00 sec)

-----

### 四、条件函数

### 1. IF 三目运算函数

 IF(expr，V1，V2)  
 功能与Java的三目运算符一样，如果expr为真，返回V1，否则为V2.

mysql> select if(1>0,'right','false');
+-------------------------+
| if(1>0,'right','false') |
+-------------------------+
| right                   |
+-------------------------+
1 row in set (0.00 sec)

### 2. isnull 判断是否为null值

mysql> select isnull(null), isnull('');
+--------------+------------+
| isnull(null) | isnull('') |
+--------------+------------+
|            1 |          0 |
+--------------+------------+
1 row in set (0.00 sec)

### 3. ifnull(str1, str2)
- 如果str1是null，则返回str2值；
- 如果str1不是null值，则返回str1值。

### 4. case when

CASE expr

                 WHEN v1 THEN r1

                 WHEN v2 THEN r2 

                ...

                  ELSE       rn

          END

mysql> select 
    ->    case 1>0
    ->        when 1 then 'true'
    ->        when 0 then 'false'
    ->        else 'more'
    ->    end 
    ->    as result;
    
+--------+
| result |
+--------+
| true   |
+--------+
1 row in set (0.00 sec)

CASE的另外一种变法。

CASE 

                 WHEN v1 THEN r1

                 WHEN v2 THEN r2 

                ...

                 ELSE       rn

          END

如果没有表达式，那么将会顺序执行下面的WHEN语句，直到第一个为条件满足，返回后面的值。若没有符合的，则返回ELSE后面的值。

mysql>  SELECT 
    ->         CASE 
    ->             WHEN 1>2 THEN 'A'
    ->             WHEN 1<2 THEN 'B'
    ->             WHEN 1<3 THEN 'C'
    ->             ELSE          'D'
    ->          END AS RESULT;
+--------+
| RESULT |
+--------+
| B      |
+--------+
1 row in set (0.00 sec)